start = ("Добро пожаловать!⚽\nИнформационный бот Футбольной школы 17/28 поможет вам получать самую актуальную "
         "информацию о ней!🏆")

admins_add = "Добавление администратора 👨‍💻"

admins_add_name = ("Отправьте мне ваше имя текстом, без форматирования (курсив, жирный,"
                   "подчёркивание и т.д.), оно может содержать эмодзи ⚽")

admins_add_proof = "Подтвердите добавление администратора:"

admins_add_complete = "Теперь вы - Администратор, можете редактировать всю информацию в этом боте🤖"
